{
    "stage1": [
        {
            "id": 1,
            "episode": 1,
            "title": " Lunch Buddies",
            "opening": "You are a university student. Your cohort mate and girlfriend, Mary, is studying with you today in school. It’s 2.08pm, and the both of you just returned from lunch. ",
            "characters": {
                "J": "John",
                "M": "Mary"
            },
            "dialogue": [
                {
                    "name": "Mary",
                    "text": "That meal was so filling I might get a food coma soon."
                },
                {
                    "name": "John",
                    "text": "Oh man, looks like today is going to be unproductive."
                },
                {
                    "name": "Mary",
                    "text": "So how much was it? I’ll eTransfer you."
                },
                {
                    "name": "John",
                    "text": "It’s fine. I’ll pay today."
                },
                {
                    "name": "Mary",
                    "text": "Wow, why’s that?"
                },
                {
                    "name": "John",
                    "text": "You deserve a treat for doing well for your quiz."
                },
                {
                    "name": "Mary",
                    "text": "Thank you!"
                },
                {
                    "name": "John",
                    "text": "No worries."
                },
                {
                    "name": "Mary",
                    "text": "Do you even have enough money for the rest of the month?"
                },
                {
                    "name": "John",
                    "text": "Uh- I try to spend less."
                },
                {
                    "name": "Mary",
                    "text": "But I’ve seen you going out frequently with Jay, Sean and the other guy."
                },
                {
                    "name": "John",
                    "text": "His name is Peter. "
                },
                {
                    "name": "Mary",
                    "text": "Yeah, him. You’re not working part time too right?"
                },
                {
                    "name": "John",
                    "text": "Nope. I just use my savings for now. "
                },
                {
                    "name": "Mary",
                    "text": "You might not last long with the way you’re spending, John."
                },
                {
                    "name": "John",
                    "text": "Well, what about you? How do you spend?"
                },
                {
                    "name": "Mary",
                    "text": "I try to limit my spending on wants, like branded items."
                },
                {
                    "name": "John",
                    "text": "Isn’t your wallet and bag is from Yucha?"
                },
                {
                    "name": "Mary",
                    "text": "Yeah, but those are birthday gifts from my family. Doesn’t count."
                },
                {
                    "name": "John",
                    "text": "What about going out with friends?"
                },
                {
                    "name": "Mary",
                    "text": "I do hang out quite often, but I don’t spend much. It’s possible."
                },
                {
                    "name": "John",
                    "text": "Interesting. Anyway, I will also need to pay for my hostel and tuition fees."
                },
                {
                    "name": "Mary",
                    "text": "Your parents are not paying for you?"
                },
                {
                    "name": "John",
                    "text": "I told him I’ll settle them myself first."
                },
                {
                    "name": "Mary",
                    "text": "But you don’t have a lot of money, right?"
                },
                {
                    "name": "John",
                    "text": "Yeah. I need to reconsider how I spend."
                },
                {
                    "name": "Mary",
                    "text": "You can part-time. Teach tuition. Work F&B. Whatever."
                },
                {
                    "name": "John",
                    "text": "I have other commitments in school too."
                },
                {
                    "name": "Mary",
                    "text": "Oh right. Community Service Club and Ultimate Frisbee."
                },
                {
                    "name": "John",
                    "text": "I’ll see what I can do then. Time to continue work."
                },
                {
                    "name": "Mary",
                    "text": "Yeah, my assignment is due in 2 days."
                },
                {
                    "name": "John",
                    "text": "Same."
                }
            ],
            "decision": "er time, you wonder about your financial status. “Is there anything I can do?” You ask yourself as you spend another graceless night with your friends. Eventually, you decide to...",
            "options": [
                {
                    "option": "1",
                    "desc": "Look for a part-time job ",
                    "outcome": "You found a tuition gig that pays really well. You finally have some income but you still decided to heed Mary’s suggestion to spend less on wants. You feel better offloading some burden off your parents while still being self-sufficient, although you had to struggle with studies and other commitments.",
                    "point": {
                        "Wealth": 25
                    }
                },
                {
                    "option": "2",
                    "desc": "Cut down on your spending.",
                    "outcome": "You decided to reduce your spending on wants. Your friends judge your frugality. You told them that you wanted to save more since you’re not earning money. You don’t feel so bad now that you spend less than before, even though you still miss getting drinks and late night supper.",
                    "point": {
                        "Wealth": 15
                    }
                },
                {
                    "option": "3",
                    "desc": "Continue living life as usual.",
                    "outcome": "You carry on living and spending your money with your good friends, sometimes even on yourself. Time passes, and you occasionally fear not having enough money to fund your entire university course. The worst that could happen is asking your parents for money. ",
                    "point": {
                        "Wealth": -15
                    }
                }
            ]
        }
    ]
}